/*

    Создаем модуль через самовызывающуюся функцию


*/

(function () {

    /* Создаем модуль */
    var app = angular.module('appName', []);

    /* КОНСТАНТЫ нашего модуля (begin)*/
    (function () {
        //app.constant();
    })();/*(end) КОНСТАНТЫ нашего модуля */


    /* ЗНАЧЕНИЯ нашего модуля (begin)*/
    (function () {
    })();/*(end) ЗНАЧЕНИЯ нашего модуля */


    /* ДИРЕКТИВЫ нашего модуля (begin)*/
    (function () {
    })();/*(end) ДИРЕКТИВЫ нашего модуля*/


    /* СЕРВИСЫ нашего модуля (begin) */
    (function () {
    })();/*(end) СЕВРИСЫ нашего модуля*/


    /* КОНТРОЛЛЕРЫ нашего модуля (begin)*/
    (function () {
    })();/*(end) КОНТРОЛЛЕРЫ нашего модуля*/


})()
